[
  {
    "title": "Introduction",
    "text": "Welcome to the Restaurant Service Standards (RSS) application, your source for achieving world-class guest service. This platform was built to help restaurants and hotels meet the highest levels of professional excellence, including recognition from internal shopper reports, elite customer review scores, and industry awards. Every section in this app is carefully structured to train teams for consistency, polish, and exceptional guest interactions."
  },
  {
    "title": "Reservation System",
    "text": "The guest experience begins long before arrival—often with a phone call, online reservation, or concierge inquiry. In this section, your team will learn how to handle reservations with precision, personalization, and courtesy. Accuracy, tone, and responsiveness are emphasized, as these qualities often shape the guest’s first impression and contribute directly to top scores in reservation-specific feedback categories."
  },
  {
    "title": "Arrival & Departure",
    "text": "A warm welcome and gracious farewell are two of the most emotionally resonant moments in any guest experience. Guests remember how they were greeted and how they were sent off, which makes these moments key performance indicators in both shopper reports and service audits. This section trains teams on the nuances of timing, body language, and attentiveness required to create memorable arrivals and departures that reinforce brand excellence."
  },
  {
    "title": "Dinner Service",
    "text": "Dinner service is the centerpiece of the guest journey and the highest-impact opportunity for achieving elite service scores. In this section, staff will master the technical and emotional aspects of hospitality that define a world-class meal experience—from pacing and sequencing to suggestive selling and proactive service. Every interaction—from the wine presentation to entrée descriptions—will be trained to meet luxury expectations. Whether your goal is a Michelin star, a five-diamond rating, or top internal scores, this section outlines how to perform dinner service with grace, awareness, and service recovery finesse."
  },
  {
    "title": "Food & Beverage Quality",
    "text": "Even the finest menu can fall short without the right service delivery. This section focuses on how the service team becomes an extension of the culinary and beverage programs, ensuring that food and drinks are presented, described, and followed up on with confidence and precision. You’ll learn to recognize product issues, communicate them effectively, and support the guest’s expectations with integrity and style—critical skills that appear on every high-level service report."
  },
  {
    "title": "Presentation of Facilities",
    "text": "Guest perception of cleanliness, ambiance, and environmental consistency plays a major role in satisfaction and scoring. This section reinforces the importance of attention to detail throughout the property—especially dining areas, restrooms, and guest pathways. High-performing teams understand that facility presentation is not just an operational concern but a core component of service excellence. This is where staff training meets pride of place and constant visual assessment."
  },
    {
    "title": "How to Use RSS",
    "text": "To get the most out of this training app, start by watching the video at the top of each section—it highlights the key themes and service expectations for that topic. Then, explore the dropdown menus, where each service standard is paired with a practical training tip designed to provide clarity and real-world application. Once you're familiar with the content, test your understanding by taking the quiz to reinforce learning and sharpen your skills. This structure ensures both a broad and detailed understanding of hospitality excellence."
  }
]
